"""
拉格朗日松弛法——外部逼近法
"""
'''
简单例子：
Min 2x1 + 3x2 + 4x3 + 5x4
s.t.
x1 + x3 >= 1
x1 + x4 >= 1
x2 + x3 + x4 >= 1
x1,x2,x3,x4 ∈ {0,1}

拉格朗日对偶形式（外部逼近法）：
Max μ
s.t.
μ <= (2x1 + 3x2 + 4x3 + 5x4) + λ1(1 - x1 - x3) + λ2(1 - x1 - x4) + λ3(1 - x2 - x3 - x4)
λ1,λ2,λ3 >= 0

其中，约束1简化为：μ <= (2 - λ1 - λ2)x1 + (3 - λ3)x2 + (4 - λ1 - λ3)x3 + (5 - λ2 - λ3)x4 + λ1 + λ2 + λ3

或：-λ1(1 - x1 - x3) - λ2(1 - x1 - x4) - λ3(1 - x2 - x3 - x4) + μ <= (2x1 + 3x2 + 4x3 + 5x4)
'''
'''
明白思路即可：（1）写出拉格朗日对偶形式，给定几个已知x当做约束，求解出λ
            （2）将λ代入拉格朗日松弛目标函数，求解问题得到新的x
            （3）新的x即为一个新约束，添加进来，求解出λ
            （4）重复（2）-（3），直到x重复出现（未变化），得到x
'''

